// Η προηγούμενη υποβολή την βδομάδα 4,είχε λάθη τα οποία διορθώθηκαν

public class Singer{
/*Βάσει των μεταβλητών στιγμιοτύπου κάθε τραγουδιστής περιγράφεται
	 από το όνομα του και το id του
	 */
	private String name;
	private int id;
/* Δηλώνεται στατική μεταβλητή. Αυτή η μεταβλητή είναι κοινόχρηστη για
	τα αντικείμενα της κλάσης.
	*Δεν υπάρχει ξεχωριστό αντίγραφο όπως γίνεται στις μεταβλητές στιγμιοτύπου
	*Όλοι οι τραγουδιστές έχουν το δικό τους όνομα (αντίγραφο της μεταβλητής name)
	*αλλά κοινή πρόσβαση στην count
	*/
	static int counter=0;
/*Στον κατασκευαστή δεν υπάρχει όρισμα για την αρχικοποίηση της μεταβλητής στιγμιοτύπου
	id. Αυτό γιατί δεν θέλουμε να αποτελεί όρισμα, άλλα να πρέπει να αποφασίσει  κάποιος
	να δώσει τιμή στο id. Θέλουμε "αυτόματα" να ανατίθεται το id σε κάθε αντικείμενο
	*λαμβάνοντας μια αυξανόμενη τιμή
	*Πχ ο πρώτος τραγουδιστής να έχει id , ο δεύτερος id 2 και όυτω το κάθε εξής
	*/
	public Singer(String name1,int id){
		name= name1;
		this.id= id;
		this.id = ++counter;
		//κάθε φορά που καλείται ο κατασκευαστής, η στατική μεταβλητή αυξάνεται και στη συνέχεια
		// δίνει την τιμή της στην id
	}

	public String getName(){
		return name;
	}

	public void setName(String name1){
	   name=name1;
	}

	public int getId(){
		return id;
	}

	public void setId(int id1){
		this.id=id;
	}
/* Μορφοποίηση αντικειμένων*/
	public String toString(){
		return "Singer[name=" +name +", id="+ id +"]";
	}

		}
